#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws-cost-slack.module.serverless.aws_cloudformation_stack.outputs_lambda_role[0] must be replaced
-/+ resource "aws_cloudformation_stack" "outputs_lambda_role" {
      - disable_rollback = false -> null
      ~ id               = "arn:aws:cloudformation:us-east-1:589845989135:stack/tf-aws-cost-slack-development-outputs-lambda-role/c45f2c20-4c8e-11ea-b734-126c5203d2c8" -> (known after apply)
      ~ name             = "tf-aws-cost-slack-development-outputs-lambda-role" -> "tf-aws-cost-slack-production-outputs-lambda-role" # forces replacement
      ~ outputs          = {
          - "LambdaExecutionRoleArn" = "arn:aws:iam::589845989135:role/tf-aws-cost-slack-development-lambda-execution"
        } -> (known after apply)
      ~ parameters       = {} -> (known after apply)
      + policy_body      = (known after apply)
      ~ tags             = {
            "Service" = "aws-cost-slack"
          ~ "Stage"   = "development" -> "production"
        }
      ~ template_body    = <<~EOT
            Resources:
              LambdaExecutionRoleArn:
                Type: AWS::SSM::Parameter
                Properties:
                  Name: "tf-aws-cost-slack-development-LambdaExecutionRoleArn"
                  Value: "arn:aws:iam::589845989135:role/tf-aws-cost-slack-development-lambda-execution"
                  Type: String
            
            Outputs:
              LambdaExecutionRoleArn:
                Description: "The ARN of the lambda execution role for Serverless to apply"
                Value: "arn:aws:iam::589845989135:role/tf-aws-cost-slack-development-lambda-execution"
                Export:
                  Name: "tf-aws-cost-slack-development-LambdaExecutionRoleArn"
            
        EOT -> (known after apply)
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group.admin[0] will be updated in-place
  ~ resource "aws_iam_group" "admin" {
        arn       = "arn:aws:iam::589845989135:group/tf-aws-cost-slack-development-admin"
        id        = "tf-aws-cost-slack-development-admin"
      ~ name      = "tf-aws-cost-slack-development-admin" -> "tf-aws-cost-slack-production-admin"
        path      = "/"
        unique_id = "AGPAYSVMPQ4H2RT6JGS5C"
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group.ci[0] will be updated in-place
  ~ resource "aws_iam_group" "ci" {
        arn       = "arn:aws:iam::589845989135:group/tf-aws-cost-slack-development-ci"
        id        = "tf-aws-cost-slack-development-ci"
      ~ name      = "tf-aws-cost-slack-development-ci" -> "tf-aws-cost-slack-production-ci"
        path      = "/"
        unique_id = "AGPAYSVMPQ4H52PB664UB"
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group.developer[0] will be updated in-place
  ~ resource "aws_iam_group" "developer" {
        arn       = "arn:aws:iam::589845989135:group/tf-aws-cost-slack-development-developer"
        id        = "tf-aws-cost-slack-development-developer"
      ~ name      = "tf-aws-cost-slack-development-developer" -> "tf-aws-cost-slack-production-developer"
        path      = "/"
        unique_id = "AGPAYSVMPQ4HUBE57OA3V"
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group_policy_attachment.admin_admin[0] must be replaced
-/+ resource "aws_iam_group_policy_attachment" "admin_admin" {
      ~ group      = "tf-aws-cost-slack-development-admin" -> "tf-aws-cost-slack-production-admin" # forces replacement
      ~ id         = "tf-aws-cost-slack-development-admin-20200211052425216900000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-admin" -> (known after apply) # forces replacement
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group_policy_attachment.admin_cd_lambdas[0] must be replaced
-/+ resource "aws_iam_group_policy_attachment" "admin_cd_lambdas" {
      ~ group      = "tf-aws-cost-slack-development-admin" -> "tf-aws-cost-slack-production-admin" # forces replacement
      ~ id         = "tf-aws-cost-slack-development-admin-20200211052425221700000002" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-cd-lambdas" -> (known after apply) # forces replacement
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group_policy_attachment.admin_developer[0] must be replaced
-/+ resource "aws_iam_group_policy_attachment" "admin_developer" {
      ~ group      = "tf-aws-cost-slack-development-admin" -> "tf-aws-cost-slack-production-admin" # forces replacement
      ~ id         = "tf-aws-cost-slack-development-admin-20200211052425236700000005" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-developer" -> (known after apply) # forces replacement
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group_policy_attachment.ci_developer[0] must be replaced
-/+ resource "aws_iam_group_policy_attachment" "ci_developer" {
      ~ group      = "tf-aws-cost-slack-development-ci" -> "tf-aws-cost-slack-production-ci" # forces replacement
      ~ id         = "tf-aws-cost-slack-development-ci-20200211052425222400000003" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-developer" -> (known after apply) # forces replacement
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group_policy_attachment.developer_developer[0] must be replaced
-/+ resource "aws_iam_group_policy_attachment" "developer_developer" {
      ~ group      = "tf-aws-cost-slack-development-developer" -> "tf-aws-cost-slack-production-developer" # forces replacement
      ~ id         = "tf-aws-cost-slack-development-developer-20200211052425223600000004" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-developer" -> (known after apply) # forces replacement
    }

  # module.aws-cost-slack.module.serverless.aws_iam_policy.admin must be replaced
-/+ resource "aws_iam_policy" "admin" {
      ~ arn    = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-admin" -> (known after apply)
      ~ id     = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-admin" -> (known after apply)
      ~ name   = "tf-aws-cost-slack-development-admin" -> "tf-aws-cost-slack-production-admin" # forces replacement
        path   = "/"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "cloudformation:PreviewStackUpdate",
                            "cloudformation:ListStacks",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "cloudformation:DeleteStack",
                            "cloudformation:CreateUploadBucket",
                            "cloudformation:CreateStack",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:cloudformation:*:589845989135:stack/sls-aws-cost-slack-development/*" -> "arn:*:cloudformation:*:589845989135:stack/sls-aws-cost-slack-production/*"
                        Sid      = ""
                    },
                    {
                        Action   = [
                            "s3:PutEncryptionConfiguration",
                            "s3:PutBucketPolicy",
                            "s3:GetEncryptionConfiguration",
                            "s3:DeleteBucketPolicy",
                            "s3:DeleteBucket",
                            "s3:CreateBucket",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:*:s3:::sls-aws-cost-slack-*-serverless*-*"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "iam:DetachRolePolicy",
                            "iam:DeleteRolePolicy",
                            "iam:DeleteRole",
                            "iam:CreateRole",
                            "iam:AttachRolePolicy",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:iam::589845989135:role/tf-aws-cost-slack-development-lambda-execution" -> "arn:*:iam::589845989135:role/tf-aws-cost-slack-production-lambda-execution"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "events:Remove*",
                            "events:Put*",
                            "events:Delete*",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:events:*:589845989135:rule/sls-aws-cost-slack-development" -> "arn:*:events:*:589845989135:rule/sls-aws-cost-slack-production"
                        Sid      = ""
                    },
                    {
                        Action   = "cloudwatch:GetMetricStatistics"
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
    }

  # module.aws-cost-slack.module.serverless.aws_iam_policy.cd_lambdas must be replaced
-/+ resource "aws_iam_policy" "cd_lambdas" {
      ~ arn    = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-cd-lambdas" -> (known after apply)
      ~ id     = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-cd-lambdas" -> (known after apply)
      ~ name   = "tf-aws-cost-slack-development-cd-lambdas" -> "tf-aws-cost-slack-production-cd-lambdas" # forces replacement
        path   = "/"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "lambda:UntagResource",
                            "lambda:TagResource",
                            "lambda:ListTags",
                            "lambda:ListFunctions",
                            "lambda:ListEventSourceMappings",
                            "lambda:GetEventSourceMapping",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "lambda:DeleteFunction",
                            "lambda:CreateFunction",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:lambda:*:589845989135:function:sls-aws-cost-slack-development-*" -> "arn:*:lambda:*:589845989135:function:sls-aws-cost-slack-production-*"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "iam:PutRolePolicy",
                            "iam:DeleteRolePolicy",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:iam::589845989135:role/tf-aws-cost-slack-development-lambda-execution" -> "arn:*:iam::589845989135:role/tf-aws-cost-slack-production-lambda-execution"
                        Sid      = ""
                    },
                    {
                        Action   = "logs:DescribeLogGroups"
                        Effect   = "Allow"
                        Resource = "arn:*:logs:*:589845989135:log-group::log-stream:"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "logs:PutLogEvents",
                            "logs:DeleteLogGroup",
                            "logs:CreateLogStream",
                            "logs:CreateLogGroup",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-development-*:log-stream:" -> "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-production-*:log-stream:"
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
    }

  # module.aws-cost-slack.module.serverless.aws_iam_policy.developer must be replaced
-/+ resource "aws_iam_policy" "developer" {
      ~ arn    = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-developer" -> (known after apply)
      ~ id     = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-developer" -> (known after apply)
      ~ name   = "tf-aws-cost-slack-development-developer" -> "tf-aws-cost-slack-production-developer" # forces replacement
        path   = "/"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = "cloudformation:ValidateTemplate"
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "cloudformation:UpdateStack",
                            "cloudformation:ListStackResources",
                            "cloudformation:ListChangeSets",
                            "cloudformation:Get*",
                            "cloudformation:DescribeStacks",
                            "cloudformation:DescribeStackResources",
                            "cloudformation:DescribeStackResource",
                            "cloudformation:DescribeStackEvents",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:cloudformation:*:589845989135:stack/sls-aws-cost-slack-development/*" -> "arn:*:cloudformation:*:589845989135:stack/sls-aws-cost-slack-production/*"
                        Sid      = ""
                    },
                    {
                        Action   = [
                            "s3:PutObject",
                            "s3:ListBucketVersions",
                            "s3:ListBucket",
                            "s3:GetObject",
                            "s3:DeleteObject",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:*:s3:::sls-aws-cost-slack-*-serverless*-*"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "iam:PassRole",
                            "iam:GetRole",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:iam::589845989135:role/tf-aws-cost-slack-development-lambda-execution" -> "arn:*:iam::589845989135:role/tf-aws-cost-slack-production-lambda-execution"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "lambda:Update*",
                            "lambda:RemovePermission",
                            "lambda:PublishVersion",
                            "lambda:ListVersionsByFunction",
                            "lambda:ListAliases",
                            "lambda:InvokeFunction",
                            "lambda:GetPolicy",
                            "lambda:GetFunctionConfiguration",
                            "lambda:GetFunction",
                            "lambda:GetAlias",
                            "lambda:CreateAlias",
                            "lambda:AddPermission",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:lambda:*:589845989135:function:sls-aws-cost-slack-development-*" -> "arn:*:lambda:*:589845989135:function:sls-aws-cost-slack-production-*"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "lambda:PublishLayerVersion",
                            "lambda:GetLayerVersion",
                            "lambda:DeleteLayerVersion",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:lambda:*:589845989135:layer:sls-aws-cost-slack-development-*" -> "arn:*:lambda:*:589845989135:layer:sls-aws-cost-slack-production-*"
                        Sid      = ""
                    },
                    {
                        Action   = [
                            "apigateway:UpdateRestApiPolicy",
                            "apigateway:PUT",
                            "apigateway:POST",
                            "apigateway:PATCH",
                            "apigateway:GET",
                            "apigateway:DELETE",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:*:apigateway:*::/tags*",
                            "arn:*:apigateway:*::/restapis*",
                        ]
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "logs:GetLogEvents",
                            "logs:FilterLogEvents",
                            "logs:DescribeLogStreams",
                            "logs:DescribeLogGroups",
                        ]
                        Effect   = "Allow"
                      ~ Resource = [
                          - "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-development-*:log-stream:*",
                          - "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-development-*:log-stream:",
                          + "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-production-*:log-stream:*",
                          + "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-production-*:log-stream:",
                        ]
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
    }

  # module.aws-cost-slack.module.serverless.aws_iam_policy.lambda must be replaced
-/+ resource "aws_iam_policy" "lambda" {
      ~ arn    = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-lambda-execution" -> (known after apply)
      ~ id     = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-lambda-execution" -> (known after apply)
      ~ name   = "tf-aws-cost-slack-development-lambda-execution" -> "tf-aws-cost-slack-production-lambda-execution" # forces replacement
        path   = "/"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                        Action   = "logs:CreateLogStream"
                        Effect   = "Allow"
                      ~ Resource = "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-development*:*" -> "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-production*:*"
                        Sid      = ""
                    },
                  ~ {
                        Action   = "logs:PutLogEvents"
                        Effect   = "Allow"
                      ~ Resource = "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-development*:*:*" -> "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-production*:*:*"
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
    }

  # module.aws-cost-slack.module.serverless.aws_iam_role.lambda[0] must be replaced
-/+ resource "aws_iam_role" "lambda" {
      ~ arn                   = "arn:aws:iam::589845989135:role/tf-aws-cost-slack-development-lambda-execution" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "lambda.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2020-02-11T05:24:24Z" -> (known after apply)
        force_detach_policies = false
      ~ id                    = "tf-aws-cost-slack-development-lambda-execution" -> (known after apply)
        max_session_duration  = 3600
      ~ name                  = "tf-aws-cost-slack-development-lambda-execution" -> "tf-aws-cost-slack-production-lambda-execution" # forces replacement
        path                  = "/"
      ~ tags                  = {
            "Service" = "aws-cost-slack"
          ~ "Stage"   = "development" -> "production"
        }
      ~ unique_id             = "AROAYSVMPQ4HSN42QWD4V" -> (known after apply)
    }

  # module.aws-cost-slack.module.serverless.aws_iam_role_policy_attachment.lambda must be replaced
-/+ resource "aws_iam_role_policy_attachment" "lambda" {
      ~ id         = "tf-aws-cost-slack-development-lambda-execution-20200211052425262100000006" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-lambda-execution" -> (known after apply) # forces replacement
      ~ role       = "tf-aws-cost-slack-development-lambda-execution" -> "tf-aws-cost-slack-production-lambda-execution" # forces replacement
    }

Plan: 12 to add, 3 to change, 12 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
